-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3307
-- Время создания: Июн 04 2023 г., 09:41
-- Версия сервера: 8.0.30
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `small`
--

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int NOT NULL,
  `title` varchar(1024) NOT NULL,
  `price` int NOT NULL DEFAULT '0',
  `old_price` int NOT NULL DEFAULT '0',
  `stock` varchar(10) DEFAULT NULL,
  `image` varchar(1024) DEFAULT NULL,
  `category` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `title`, `price`, `old_price`, `stock`, `image`, `category`) VALUES
(1, 'СУЛТАН                                                   <br>                                     Макароны спираль 1,6кг', 1149, 1550, '-26%', 'images/4870091002223.png', 'Бакалея'),
(2, 'СУЛТАН                                                   <br>                                     Макароны  паутинка 1,6кг', 1149, 1570, '-27%', 'images/4870091002254.png', 'Бакалея'),
(3, 'СУЛТАН                                                   <br>                                     Макароны  витушки 1,6кг', 1149, 1570, '-27%', 'images/4870091002346.png', 'Бакалея'),
(4, 'ЗАБОТА                                     <br>                                     Масло подсолнечное 5л', 4309, 4560, '-6%', 'images/4870003260703.png', 'Бакалея'),
(5, 'МАСЛОЗАВОД №1                                            <br>                                     Масло подсолнечное №1 2л', 1725, 1824, '-5%', 'images/4870003260604.png', 'Бакалея'),
(6, 'ВЫБОР ШЕФА                                               <br>                                     Ванилин кристаллический 3 гр', 45, 75, '-40%', 'images/745125381497.png', 'Бакалея'),
(7, 'ВЫБОР ШЕФА                                               <br>                                     Приправа для шашлыка 120 гр', 249, 395, '-37%', 'images/745125381435.png', 'Бакалея'),
(8, 'ВКУСНОМАМА                                               <br>                                     Шарики  кукурузные kaprizel/сюрприз 30 гр', 1229, 1615, '-24%', 'images/4607975460073.png', 'Бакалея'),
(9, 'ДОБРАЯ                                                   <br>                                     Кукурузные палочки хит 250 гр', 315, 415, '-24%', 'images/4870007561028.png', 'Бакалея'),
(10, 'BEST MILK                                                <br>                                     Молоко топленое 2,5%  850 мл', 339, 410, '-17%', 'images/4870207561736.png', 'Бакалея'),
(11, 'BIG-BON                                                  <br>                                     Лапша big-bon 100гр со вкусом острой говядины', 225, 340, '-34%', 'images/4605496022787.png', 'Бакалея'),
(12, 'BIG-BON                                                  <br>                                     Лапша big-bon 100гр со вкусом острой курицы', 225, 340, '-34%', 'images/4605496022794.png', 'Бакалея'),
(13, 'BIG-BON                                                  <br>                                     Лапша big-bon 100гр со вкусом говядины и грибов', 225, 340, '-34%', 'images/4605496022848.png', 'Бакалея'),
(14, 'АБЗАЛ                                     <br>                                     Рис камол.лидер 3кг', 1899, 2125, '-11%', 'images/4870005650557.png', 'Бакалея'),
(15, 'ВЫГОДНО                                     <br>                                     Крупа пшеничная 450 гр', 155, 180, '-14%', 'images/4870200850592.png', 'Бакалея'),
(16, 'МАКФА                                     <br>                                     КРУПА ГРЕЧНЕВАЯ 800гр', 699, 900, '-22%', 'images/4601780005399.png', 'Бакалея'),
(17, 'ПАССИМ                                                   <br>                                     РИС КРУГЛОЗЕРНЫЙ 800гр', 995, 1195, '-17%', 'images/4605093001772.png', 'Бакалея'),
(18, 'ЦАРСКАЯ КАША                                             <br>                                     КРУПА МАННАЯ 600гр', 285, 360, '-21%', 'images/4870204230277.png', 'Бакалея'),
(19, 'КЭММИ                                                    <br>                                     Лапша яичная бесбармачная 250гр', 259, 350, '-26%', 'images/4870001220266.png', 'Бакалея'),
(20, 'МАКФА                                                    <br>                                     Макароны вермишель длинная оригинал 400гр', 385, 455, '-15%', 'images/4601780000578.png', 'Бакалея'),
(21, 'МАКФА                                                    <br>                                     МАКАРОНЫ ВЕРМИШЕЛЬ 400гр', 385, 455, '-15%', 'images/4601780006976.png', 'Бакалея'),
(22, 'МАКФА                                                    <br>                                     Макароны спирали 400гр', 385, 455, '-15%', 'images/4601780006990.png', 'Бакалея'),
(23, 'МАКФА                                                    <br>                                     МАКАРОНЫ 400гр', 385, 455, '-15%', 'images/4601780009861.png', 'Бакалея'),
(24, 'МАКФА                                     <br>                                     Макароны перья любительские 400гр', 385, 455, '-15%', 'images/4601780009885.png', 'Бакалея'),
(25, 'СУЛТАН                                         <br>                                     Рожки №5 1,6кг', 1149, 1550, '-26%', 'images/4870091002285.png', 'Бакалея'),
(26, 'СУЛТАН                                     <br>                                     Макароны спагетти 1,6 кг', 1149, 1430, '-20%', 'images/4870091002513.png', 'Бакалея'),
(27, 'ЦЕСНА                                     <br>                                     Перья 8мм 400гр', 245, 400, '-39%', 'images/4870006610284.png', 'Бакалея'),
(28, 'ЦЕСНА                                     <br>                                     Макароны ракушки 20,5мм 400гр', 245, 400, '-39%', 'images/4870006610321.png', 'Бакалея'),
(29, 'ЦЕСНА                                     <br>                                     Паутинка 1мм 400гр', 245, 400, '-39%', 'images/4870006610338.png', 'Бакалея'),
(30, 'ЦЕСНА                                     <br>                                     Вермишель 400 гр', 245, 400, '-39%', 'images/4870006610680.png', 'Бакалея'),
(31, 'ЦЕСНА                                     <br>                                     Макароны рожки гладкие 400 гр', 245, 400, '-39%', 'images/4870006610710.png', 'Бакалея'),
(32, 'ЦЕСНА                                     <br>                                     Макароны спираль 400гр', 245, 400, '-39%', 'images/4870006612127.png', 'Бакалея'),
(33, 'ЦЕСНА                                     <br>                                     Рожки рифленые 6мм 400гр', 245, 400, '-39%', 'images/4870006612196.png', 'Бакалея'),
(34, 'ЦЕСНА                                     <br>                                     Макароны витки №7 400 гр', 245, 400, '-39%', 'images/4870006612202.png', 'Бакалея'),
(35, 'МАКФА                                     <br>                                     МУКА  ВЫСШИЙ СОРТ 2кг', 699, 825, '-15%', 'images/4601780014759.png', 'Бакалея'),
(36, 'СНЕЖИНКА                                                 <br>                                     МУКА 10кг', 2779, 3045, '-9%', 'images/4870207750048.png', 'Бакалея'),
(37, 'РУСАГРО                                                  <br>                                     Сахар чайкофский рафинад белый 1000 гр', 799, 1175, '-32%', 'images/4607046120066.png', 'Бакалея'),
(38, 'NESTLE                                                   <br>                                     Завтрак шоколадный 650 гр', 1339, 1875, '-29%', 'images/4600680025568.png', 'Бакалея'),
(39, 'NESTLE                                                   <br>                                     Завтрак duo шоколадный 650 гр', 1339, 1875, '-29%', 'images/4600680025599.png', 'Бакалея'),
(40, 'ВЫГОДНО                                                  <br>                                     Перчики piri piri маринов слегка 300 мл', 475, 595, '-20%', 'images/2000000351630.png', 'Консервация'),
(41, 'ЦИН-КАЗ                                                  <br>                                     Салат осенний 700 гр', 615, 975, '-37%', 'images/4870001085810.png', 'Консервация'),
(42, 'БЕЛГОРОДСКИЕ ОВОЩИ                                     <br>                                     ГОРОШЕК ЗЕЛЕНЫЙ ВЫСШИЙ СОРТ 400гр', 455, 709, '-36%', 'images/4606599003277.png', 'Консервация'),
(43, 'БЕЛГОРОДСКИЕ ОВОЩИ                                       <br>                                     КУКУРУЗА САХАРНАЯ 400гр', 455, 645, '-29%', 'images/4606599004465.png', 'Консервация'),
(44, 'ВЫГОДНО                                                  <br>                                     Фасоль белая 400 гр', 429, 540, '-21%', 'images/4606599008784.png', 'Консервация'),
(45, 'ВЫГОДНО                                                  <br>                                     Фасоль красная в томатном соусе 400 гр', 429, 550, '-22%', 'images/4606599008807.png', 'Консервация'),
(46, 'DONGWON                                                  <br>                                     Тунец светлый обогащенный омега 3 150 гр', 1199, 1599, '-25%', 'images/8801047114222.png', 'Консервация'),
(47, 'МОРСКОЙ РИФ                                              <br>                                     Сардина атлантическая в масле 250гр', 425, 755, '-44%', 'images/4870218890276.png', 'Консервация'),
(48, 'АС                                                       <br>                                     Салат из морской капусты 380 гр', 825, 1080, '-24%', 'images/4870202042902.png', 'Консервация'),
(49, 'ТОМАТНЫЙ РАЙ                                     <br>                                     Томатная паста 720мл', 815, 995, '-18%', 'images/4870144745169.png', 'Консервация'),
(50, 'ВЛАДИМИРОВ. СТАНДАРТ                                     <br>                                     Колбаса салями по-финск 350 гр', 1099, 1669, '-34%', 'images/4607100235798.png', 'Колбаса, деликатесы'),
(51, 'ВЛАДИМИРОВ. СТАНДАРТ                                     <br>                                     Сосиски баварские 420 гр', 1249, 2049, '-39%', 'images/4607100235859.png', 'Колбаса, деликатесы'),
(52, 'АДАЛ ХАЛАЛ                                               <br>                                     Колбаса конская полукопченая', 2049, 2597, '-21%', 'images/2000000184752.png', 'Колбаса, деликатесы'),
(53, 'АРАЙ                                     <br>                                     Колбаса батыр халал 500 гр', 2435, 3365, '-28%', 'images/4870236030029.png', 'Колбаса, деликатесы'),
(54, 'АРАЙ                                     <br>                                     Колбаски мусульманские халал 300 гр', 1235, 1610, '-23%', 'images/4870236030180.png', 'Колбаса, деликатесы'),
(55, 'ПАПА МОЖЕТ                                               <br>                                     Колбаса 400гр мясная вареная', 969, 1445, '-33%', 'images/4607958070862.png', 'Колбаса, деликатесы'),
(56, 'ПАПА МОЖЕТ                                     <br>                                     Колбаса ароматная 250 гр', 1615, 2035, '-21%', 'images/4607958073047.png', 'Колбаса, деликатесы'),
(57, 'СИБПРОДКОМП                                              <br>                                     Сервелат венский 380 гр', 1685, 2619, '-36%', 'images/4607058599508.png', 'Колбаса, деликатесы'),
(58, 'СПК                                                      <br>                                     Колбаса салями 260 гр', 1645, 2649, '-38%', 'images/4630006266849.png', 'Колбаса, деликатесы');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
